{"0.1":["Mohammad Irfan to Roy","FOUR","full and a touch wide and Roy gets out to lash it through the covers, positive intent from the off"],"0.2":["Mohammad Irfan to Roy","no run","draws his length back a touch, this zips through as Roy plays no stroke"],"0.3":["Mohammad Irfan to Roy","2 runs","gets forward, check-drives this time, into a gap in the covers and gets a couple more"],"0.4":["Mohammad Irfan to Roy","1 run","pushes from the crease, inside-edged through backward square"],"0.5":["Mohammad Irfan to Hales","no run","slightly back of a length, in the channel and Hales lets it go"],"0.6":["Mohammad Irfan to Hales","1 run","bit of width, Hales toe-ends a cut in the air down towards third man, could have gone awry but picks up a single to get off the mark"],"1.1":["Anwar Ali to Hales","no run","starts slightly short, tapped into the covers"],"1.2":["Anwar Ali to Hales","FOUR","slides on to the pads, Hales clips it past the diving short fine leg and gets a boundary to his name"],"1.3":["Anwar Ali to Hales","no run","defends coming forwards around off stump"],"1.4":["Anwar Ali to Hales","no run","length ball, Hales shows it a straight bat"],"1.5":["Anwar Ali to Hales","no run","angled in and worked off the body short into the leg side"],"1.6":["Anwar Ali to Hales","no run","good length on off stump, Hales shows it a straight bat in defence once again"],"2.1":["Mohammad Irfan to Roy","no run","slower ball from Irfan, poked off the hips towards square"],"2.2":["Mohammad Irfan to Roy","OUT","extra lift from a length and Roy spoons it to cover! The giant picks up his first victim, he punches the air in delight... Roy was pushing out in front of him, closing the face slightly and a thick leading edge flew towards the edge of the ring"],"2.3":["Mohammad Irfan to Root","no run","bowling round the wicket, pitched up and defended coming forwards"],"2.4":["Mohammad Irfan to Root","no run","length ball slightly wide of the stumps, left alone"],"2.5":["Mohammad Irfan to Root","no run","pushed into the covers coming across"],"2.6":["Mohammad Irfan to Root","1 run","short outside off, 86mph and steered away with a horizontal bat down to third man"],"3.1":["Anwar Ali to Root","no run","slightly short of a length and defended into the off side"],"3.2":["Anwar Ali to Root","1 run","pitched up and punched towards mid-on, Root takes on the fielder and although he has to detour around Anwar he gets in okay"],"3.3":["Anwar Ali to Hales","1 run","goes back and runs one to third man"],"3.4":["Anwar Ali to Root","1 run","pitched up, Root skips out and opens the face, steers it past backward point"],"3.5":["Anwar Ali to Hales","1 run","full and straight, clipped off the toes through square leg"],"3.6":["Anwar Ali to Root","FOUR","dropped short by Anwar and Root thwocks a pull away to the square-leg boundary with control to spare"],"4.1":["Mohammad Irfan to Hales","no run","leading edge, back to the bowler, he collapses like a felled oak... and drops it! He actually did well to fall right into its path, stuck out a big left paw and then grassed it, off the wrist"],"4.2":["Mohammad Irfan to Hales","1 run","back and across and runs the ball to third man"],"4.3":["Mohammad Irfan to Root","no run","jumps back and lets this one go"],"4.4":["Mohammad Irfan to Root","1 run","slammed in short, a snorter at 88mph and Root is fending blindly in front of his face, loops off the glove behind square - no catcher in. Actually, his bottom hand was off the bat when it hit the glove"],"4.5":["Mohammad Irfan to Hales","no run","short of a length, steered towards backward point"],"4.6":["Mohammad Irfan to Hales","no run","another fiery bumper from Irfan, the batsman collapses underneath"],"5.1":["Zafar Gohar to Root","no run","pushed through outside off, goes back and sends a cut towards point"],"5.2":["Zafar Gohar to Root","1 run","pitched up and punched into a gap in the covers coming forwards"],"5.3":["Zafar Gohar to Hales","1 run","angled in with the arm from round the wicket, clipped off the legs behind square"],"5.4":["Zafar Gohar to Root","2 runs","drops a little short, Root pulls in the air over midwicket, shouts of \"catch!\" but it was well in front of the man in the deep and they get back for two"],"5.5":["Zafar Gohar to Root","OUT","Root slogs a full toss straight to deep square leg! Wicket in his first over for Gohar, he'll bowl better balls for less reward in his international career, for sure, but they don't add descriptions in the scorebook. Root just shovelled it straight to Iftikhar a few yards in, took a good catch above his head"],"5.6":["Zafar Gohar to Morgan","1 run","flat on the stumps, clipped past the dive of midwicket for a single"],"6.1":["Mohammad Irfan to Morgan","no run","gets across and defends a length ball"],"6.2":["Mohammad Irfan to Morgan","no run","oof, Morgan is hit on the shoulder trying to pull a bouncer, he looks in a bit of discomfort initially but seems okay... Though the shot early, deflected off the upper arm into the helmet"],"6.3":["Mohammad Irfan to Morgan","1 run","goes round the wicket, full on the legs, Morgan gets a scrape of bat on it"],"6.4":["Mohammad Irfan to Hales","no run","bangs in the short ball, at the batsman, who ducks sharpish"],"6.5":["Mohammad Irfan to Hales","no run","ooh, that's a beauty, a cutter from Irfan that beats the bat by a distance, bobbles low through to the keeper"],"6.6":["Mohammad Irfan to Hales","no run","nips one past the outside edge again! Gets some extravagant movement by rolling his fingers over it, superb stuff"],"7.1":["Zafar Gohar to Morgan","no run","over the wicket, pushed back down the track"],"7.2":["Zafar Gohar to Morgan","no run","tossed up and driven hard, in the air, straight back at the bowler... who doesn't lay a hand on it, though he does take a blow on the arm, the ball deflecting away through mid-on. A tough, tough chance, Gohar couldn't react in time"],"7.3":["Zafar Gohar to Morgan","1 run","tossed up and worked through the leg side for a single"],"7.4":["Zafar Gohar to Hales","no run"],"7.5":["Zafar Gohar to Hales","1 run","sliding on with the arm, Hales flicks it behind square on the leg side"],"7.6":["Zafar Gohar to Morgan","no run","leans into a forward defensive"],"8.1":["Mohammad Irfan to Hales","no run","short outside off, Hales reaches for a cut and was perilously close to nicking off"],"8.2":["Mohammad Irfan to Hales","no run","unplayable! Short and rising towards the shoulder, moved late too, just past the gloves"],"8.3":["Mohammad Irfan to Hales","1 run","drops back and runs a single to third man"],"8.4":["Mohammad Irfan to Morgan","no run","shortish, lets this one through"],"8.5":["Mohammad Irfan to Morgan","no run","bangs it in short and Morgan flinches out of the way"],"8.6":["Mohammad Irfan to Morgan","no run","good length, 86mph around off stump, defended into the covers - excellent over from Irfan"],"9.1":["Zafar Gohar to Hales","1 run","pushed into a gap for one"],"9.2":["Zafar Gohar to Morgan","no run","flighted outside off, leans out and defends"],"9.3":["Zafar Gohar to Morgan","1 run","angled in, played with the spin wide of mid-on"],"9.4":["Zafar Gohar to Hales","no run","length outside off, Hales chops it into the covers"],"9.5":["Zafar Gohar to Hales","SIX","plants the front foot and plants him into the stands! The slog-sweep from Hales, utilising his long reach, absolutely hammered over the rope"],"9.6":["Zafar Gohar to Hales","no run","quicker ball from Gohar, nearly catches Hales unawares, jams the bat down in time"],"10.1":["Wahab Riaz to Morgan","no run","presses forward and defends solidly around off"],"10.2":["Wahab Riaz to Morgan","FOUR","drops short and Morgan dismissively pulls it flat through backward square for four, looked comfortable with that"],"10.3":["Wahab Riaz to Morgan","1 run","length outside off, comes forward and plays through the covers"],"10.4":["Wahab Riaz to Hales","no run","slightly short, up towards 90mph, Hales reaches outside off and bottom-edges through to the keeper on the bounce"],"10.5":["Wahab Riaz to Hales","no run","slower ball from Wahab, a cutter that Hales can only push back down the track"],"10.6":["Wahab Riaz to Hales","no run","targeting the stumps, 87mph and played late, chopped into the ground towards backward point"],"11.1":["Iftikhar Ahmed to Morgan","no run","tossed up, pushed back to the bowler"],"11.2":["Iftikhar Ahmed to Morgan","no run","makes room to try and cut, gets an inside edge towards midwicket"],"11.3":["Iftikhar Ahmed to Morgan","no run","pushed through flat on off stump, punched into the covers"],"11.4":["Iftikhar Ahmed to Morgan","no run","good length, chopped towards cover from the crease"],"11.5":["Iftikhar Ahmed to Morgan","no run","pushed through flat outside off, drops back and sends the ball to point - another dot"],"11.6":["Iftikhar Ahmed to Morgan","1 run","gets on to the front foot and drives, gets it past mid-off and they trot a single. Decent start from Iftikhar, though"],"12.1":["Wahab Riaz to Morgan","1 run","pushed into the leg side, they steal a single... but the throw to the non-striker's end is a direct hit, with Morgan having to swerve round the bowler. It looked close but he was comfortably home in the end"],"12.2":["Wahab Riaz to Hales","1 run","slightly short, outside off, Hales reaches out and squirts one to third man"],"12.3":["Wahab Riaz to Morgan","no run","good length around the line of off, Morgan shows it a straight bat"],"12.4":["Wahab Riaz to Morgan","no run","slower ball from Wahab, just 66mph and Morgan is through the shot early, plays it on the full and in the air but lands short of mid-off"],"12.5":["Wahab Riaz to Morgan","FOUR","short and heading down the leg side, Morgan helps it on its way down to fine leg with a swat of the bat"],"12.6":["Wahab Riaz to Morgan","1 run","shortish, 87mph outside off, runs one more to third man"],"13.1":["Iftikhar Ahmed to Morgan","1 run","goes back and across and pushes into a gap"],"13.2":["Iftikhar Ahmed to Hales","1 leg bye","stays round the wicket, tossed up on the pads, deflects behind square"],"13.3":["Iftikhar Ahmed to Morgan","no run","angled in flat on the stumps, Morgan defends back down the track"],"13.4":["Iftikhar Ahmed to Morgan","1 run","slightly short, punched down the ground to long-off"],"13.5":["Iftikhar Ahmed to Hales","FOUR","darted on the stumps and Hales crunches a sweep into the gap between deep midwicket and fine leg, that's four"],"13.6":["Iftikhar Ahmed to Hales","no run","tossed up a little more, dabbed towards square leg"],"14.1":["Wahab Riaz to Morgan","no run","Morgan gets across to defend a 88mph delivery without fuss"],"14.2":["Wahab Riaz to Morgan","no run","good length, moves into line and defends again"],"14.3":["Wahab Riaz to Morgan","1 run","slower ball, waits for it and clips one to deep square leg"],"14.4":["Wahab Riaz to Hales","no run","short at the body, 88mph and jabbed away square on the leg side"],"14.5":["Wahab Riaz to Hales","1 run","full and wide of the off stump, Hales dabs it down to third man"],"14.6":["Wahab Riaz to Morgan","no run","length around the line of off, Morgan bows his head over it in defence"],"15.1":["Shoaib Malik to Hales","1 run","floated up and clipped through midwicket to the man in the deep"],"15.2":["Shoaib Malik to Morgan","1 run","pushed through outside off, turning away fractionally as Morgan slaps it through backward point"],"15.3":["Shoaib Malik to Hales","no run","over the wicket, length ball, played with the turn to square leg"],"15.4":["Shoaib Malik to Hales","1 run","flighted, flicked off the toes behind square"],"15.5":["Shoaib Malik to Morgan","no run","oh, well bowled, beats everything! Morgan tried to drive through the off side, the ball pitched on middle and off, spun past the bat, past the timber and into the gloves"],"15.6":["Shoaib Malik to Morgan","1 run","skidding on this time, clips the inside edge and runs behind square on the leg side"],"16.1":["Wahab Riaz to Morgan","1 run","full outside off, guides this away behind point"],"16.2":["Wahab Riaz to Hales","no run","straight delivery, just back of a length, defended to midwicket"],"16.3":["Wahab Riaz to Hales","no run","driven into the ground and it bounces to backward point"],"16.4":["Wahab Riaz to Hales","1 run","tucks this one off his hip into square leg"],"16.5":["Wahab Riaz to Morgan","1 run","short outside off, another slower ball, not much pace to work with and it plops (I'm sure that's a term in the MCC coaching manual) through the off side"],"16.6":["Wahab Riaz to Hales","no run","trying to guide this down to third man, angled across him, and the ball beats the top edge"],"17.1":["Shoaib Malik to Morgan","no run","slides in from round the wicket, cut into the off side"],"17.2":["Shoaib Malik to Morgan","no run","forward with bat and pad together"],"17.3":["Shoaib Malik to Morgan","FOUR","brings out the reverse sweep, or club, as though it is an everyday shot - which for him it is - and swats it away from wide outside off through third man"],"17.4":["Shoaib Malik to Morgan","no run","fuller, driven to cover"],"17.5":["Shoaib Malik to Morgan","1 run","edged! But doesn't carry to slip. Nice turn as Morgan comes forward, but it dies off the outside edge"],"17.6":["Shoaib Malik to Hales","no run","a mighty appeal for a catch down the leg side! Malik and Sarfraz are convinced Hales has touched this. Umpire Raza says not out and they review. Clipped the thigh pad? Looks a good decision. And, yep, it stays onfield"],"18.1":["Zafar Gohar to Morgan","FOUR","and he's met by a powerful reverse sweep from Morgan, a slightly fuller delivery than the one he struck last time, gets right over the top and it whistles along the ground"],"18.2":["Zafar Gohar to Morgan","no run","flicked from outside off to midwicket"],"18.3":["Zafar Gohar to Morgan","no run","appeal for lbw but that's struck him well outside the line, Morgan trying to flick it to the leg side"],"18.4":["Zafar Gohar to Morgan","no run","another huge shout! This has more going for it. Morgan back in his crease, sharp spin to take the pad but may have been going down leg. The review is gone, remember"],"18.5":["Zafar Gohar to Morgan","no run","grip and spin, Morgan takes his bottom hand off the bat...worth a short leg? Pakistan need wickets"],"18.6":["Zafar Gohar to Morgan","no run","full outside off, he thrusts his bat in front of the pad this time as he blocks...interesting over"],"19.1":["Shoaib Malik to Hales","2 leg byes","they are screaming for everything at the moment, Hales taken on the pad from round the wicket as he plays back, it gripped again, and deflects through fine leg...going down"],"19.2":["Shoaib Malik to Hales","1 run","plays back again, flicked through midwicket"],"19.3":["Shoaib Malik to Morgan","no run","full on middle and leg, tapped to the on side"],"19.4":["Shoaib Malik to Morgan","no run","defended to cover"],"19.5":["Shoaib Malik to Morgan","no run","full at off stump, small stride forward, block (leg slip has become slip for Morgan)"],"19.6":["Shoaib Malik to Morgan","no run","full at the stumps, defended square into the off side"],"20.1":["Zafar Gohar to Hales","no run","full and straight, pushed to the covers"],"20.2":["Zafar Gohar to Hales","2 runs","swept off the stumps and Irfan dives (or collapses) over it at short fine-leg"],"20.3":["Zafar Gohar to Hales","OUT","done him! It was on the cards. Lovely bowling. Floated up full, Hales leans forward and prods in front of his pads, the outside edge carries low to slip"],"20.4":["Zafar Gohar to Taylor","no run","full at off stump, driven to cover"],"20.5":["Zafar Gohar to Taylor","no run","pushed up very full, blocked back down the pitch...plenty of noise in the field and the stands"],"20.6":["Zafar Gohar to Taylor","2 byes","a beauty! Was that an edge? It's gone to third man. Big spin and turn. Defeats Taylor's edge as he prods forward, the keeper and slip"],"21.1":["Shoaib Malik to Morgan","no run","round the wicket, full at off stump, defended"],"21.2":["Shoaib Malik to Morgan","1 run","touch shorter, Morgan rocks back and drives through the covers"],"21.3":["Shoaib Malik to Taylor","1 run","round the wicket, swept to deep square leg"],"21.4":["Shoaib Malik to Morgan","2 runs","gets this through the infield, a hint of width outside off, Morgan cuts through point but there's a boot on it near the boundary"],"21.5":["Shoaib Malik to Morgan","OUT","and another! Lovely delivery, but Morgan has missed it by a long way. Playing back, it pitched on middle, turned sharply and struck off stump. Morgan comprehensively defeated"],"21.6":["Shoaib Malik to Buttler","no run","plays back, deflects off the pad wide of leg slip"],"22.1":["Zafar Gohar to Taylor","no run","forward and defended"],"22.2":["Zafar Gohar to Taylor","FOUR","another edge! Taylor also going back, more sharp spin - it goes square - takes the edge but Taylor's hands are soft it beats slip having not carried"],"22.3":["Zafar Gohar to Taylor","no run","you can feel the pressure, now he tries to sweep and doesn't make contact"],"22.4":["Zafar Gohar to Taylor","FOUR","makes use of a low full toss outside leg stump, gets over the top and sweeps it wide of short fine-leg...Malik tries to get there, but slips on the boundary edge. Looks in a bit of pain"],"22.5":["Zafar Gohar to Taylor","1 run","touch short, driven out to the cover sweeper"],"22.6":["Zafar Gohar to Buttler","no run","a play and a miss from Buttler, it was short and he went back to cut but there was extra bounce to beat the top edge"],"23.1":["Shoaib Malik to Taylor","1 run","round the wicket, full outside off, driven down the ground"],"23.2":["Shoaib Malik to Buttler","no run","missed stumping, Buttler came down the pitch, yorked himself, played over the top of the delivery, Sarfraz couldn't make the take. Buttler was a long way down"],"23.3":["Shoaib Malik to Buttler","1 run","goes back and works a straight delivery with the spin to the leg side"],"23.4":["Shoaib Malik to Taylor","1 run","sweeps this very hard off the stumps, sweetly connected, but almost straight to deep square"],"23.5":["Shoaib Malik to Buttler","2 runs","full and a touch wide, Buttler comes forward and drives wide of the cover sweeper"],"23.6":["Shoaib Malik to Buttler","1 run","gets over the ball and drives to long on"],"24.1":["Zafar Gohar to Buttler","FOUR","well, that takes some guts, reverse sweeps and places it very well wide of backward point"],"24.2":["Zafar Gohar to Buttler","no run","terrific response from Gohar, floated up at off stump, spins past Buttler's edge as he lunges forward"],"24.3":["Zafar Gohar to Buttler","no run","that's even better! Unplayable. Pitched around middle and leg, rips past the outside edge and off stump. Jeepers."],"24.4":["Zafar Gohar to Buttler","FOUR","this is fantastic cricket, Buttler brings out the reverse sweep again, not quite as clean as the previous one but gets it finer and beats short third man"],"24.5":["Zafar Gohar to Buttler","2 runs","adjusts his line, drifts full onto leg stump, clipped through midwicket and placed well enough for a second"],"24.6":["Zafar Gohar to Buttler","1 run","drags this a little short, driven to deep cover"],"25.1":["Shoaib Malik to Buttler","1 run","round the wicket, full outside off, eased down the ground to long on"],"25.2":["Shoaib Malik to Taylor","no run","uses his feet then whips to midwicket"],"25.3":["Shoaib Malik to Taylor","1 run","down the pitch again, flicks this through the vacant short fine-leg area...the running will be quick with this pair"],"25.4":["Shoaib Malik to Buttler","1 run","back into the crease again, plays with the spin behind square on the leg side"],"25.5":["Shoaib Malik to Taylor","no run","down the pitch, not quite to the ball, has to lunge at it as he defends"],"25.6":["Shoaib Malik to Taylor","1 run","gets down and plays a neat paddle-sweep from outside leg"],"26.1":["Azhar Ali to Taylor","2 runs","dragged down short outside off, Taylor pulls hard through midwicket"],"26.2":["Azhar Ali to Taylor","no run","short and wide, a fairly horrid ball, and a fairly horrid shot as Taylor swipes and misses"],"26.3":["Azhar Ali to Taylor","no run","full at the stumps, driven back to the bowler"],"26.4":["Azhar Ali to Taylor","1 run","whipped from full outside off with the bottom hand towards mid-on"],"26.5":["Azhar Ali to Buttler","1 run","think that was the googly, not sure Buttler picked it, went for the reverse sweep and gets a bottom edge to short third man"],"26.6":["Azhar Ali to Taylor","no run","beats him again, a quick ball outside off which also turns, defeats Taylor's cut and he's angry with himself"],"27.1":["Shoaib Malik to Buttler","1 run","staying round the wicket, opens the face and places to deep point"],"27.2":["Shoaib Malik to Taylor","no run","tries to work this into space on the leg side but finds midwicket"],"27.3":["Shoaib Malik to Taylor","2 runs","a bottom-handed flick through midwicket, the ball was full outside off, good placement wide of the deep sweeper"],"27.4":["Shoaib Malik to Taylor","SIX","that's a big blow! Enough of the tippy-tappy for Taylor, he comes down the pitch then goes with the spin high over deep midwicket with a pick-up shot"],"27.5":["Shoaib Malik to Taylor","2 runs","now he works a flatter ball off the pads wide of leg side"],"27.6":["Shoaib Malik to Taylor","no run","full, blocked"],"28.1":["Azhar Ali to Buttler","1 run","very full, dug out through the covers to the sweeper"],"28.2":["Azhar Ali to Taylor","1 run","ooh, that's a big full toss, but only costs a single as Taylor swats to deep midwicket"],"28.3":["Azhar Ali to Buttler","1 run","pitches this one, full and straight, flicked through midwicket to bring up a very brisk 50-runs stand"],"28.4":["Azhar Ali to Taylor","no run","sharp spin! Rips away from the outside edge, but think Taylor pulled his bat inside the line this time"],"28.5":["Azhar Ali to Taylor","no run","shorter, cut to backward point"],"28.6":["Azhar Ali to Taylor","no run","short and wide, but Taylor cuts straight to cover"],"29.1":["Wahab Riaz to Buttler","no run","full at middle and off, forward and defended to cover"],"29.2":["Wahab Riaz to Buttler","no run","defended to the bowler"],"29.3":["Wahab Riaz to Buttler","1 run","back of a length on off stump, neatly driven out to deep cover"],"29.4":["Wahab Riaz to Taylor","no run","on his toes, pinged to mid-off"],"29.5":["Wahab Riaz to Taylor","no run","tries to force this through the off side but he's cramped for room"],"29.6":["Wahab Riaz to Taylor","no run","full at the stumps, Taylor shuffling across the crease and defends"],"30.1":["Mohammad Irfan to Buttler","no run","round the wicket, a slower short ball, defeats Buttler as he goes for a square swat"],"30.2":["Mohammad Irfan to Buttler","1 run","nearly finds third man! Short of a length outside off, Buttler cuts and slices it just in front of the fielder...one bounce"],"30.3":["Mohammad Irfan to Taylor","1 run","short outside off, Taylor gets over the top and plays to deep point"],"30.4":["Mohammad Irfan to Buttler","1 run","opens the face and places this calmly through point to the sweeper"],"30.5":["Mohammad Irfan to Taylor","1 run","short, angled into the body, Taylor rolls his wrists on the pull down to long leg"],"30.6":["Mohammad Irfan to Buttler","no run","full at off stump, 76mph, defended to cover"],"31.1":["Wahab Riaz to Taylor","no run","tries to force through the off side, gets a thick inside edge which isn't a million miles from the stumps"],"31.2":["Wahab Riaz to Taylor","1 run","short ball, 83mph, Taylor responds with a rasping pull which skims, one bounce, to fine leg"],"31.3":["Wahab Riaz to Buttler","1 run","full outside off, 89mph, driven to the cover sweeper"],"31.4":["Wahab Riaz to Taylor","no run","comes forward, nearly punches this in the air to cover but just stops himself from going too hard"],"31.5":["Wahab Riaz to Taylor","1 run","back of a length, smartly dropped into the off side and they steal a single that probably shouldn't have been on offer"],"31.6":["Wahab Riaz to Buttler","1 run","short, on leg stump, pulled to deep square"],"32.1":["Zafar Gohar to Buttler","no run","full at the stumps, driven firmly at cover"],"32.2":["Zafar Gohar to Buttler","1 run","juicy full toss which is swung through the leg side but only a single to deep midwicket"],"32.3":["Zafar Gohar to Taylor","no run","appeal for lbw, Taylor flicking across the line of a full ball, heading leg side and may have hit it as well"],"32.4":["Zafar Gohar to Taylor","no run","another shout for lbw, Taylor on the sweep, pitched outside leg by looks of it"],"32.5":["Zafar Gohar to Taylor","no run","this one spins, defends square to the off side"],"32.6":["Zafar Gohar to Taylor","no run","goes back, takes the pad to the leg side"],"33.1":["Mohammad Irfan to Buttler","1 run","short of a length outside off, drops back and dabs to third man"],"33.2":["Mohammad Irfan to Taylor","1 run","drops short again, at the body, Taylor swivels quickly to pull"],"33.3":["Mohammad Irfan to Buttler","1 run","fullish, mid-80s mph in the channel, Buttler presses out and steers through cover"],"33.4":["Mohammad Irfan to Taylor","FOUR","shouts of \"catch!\" as Taylor mistimes an aerial drive, his bottom hand coming off the bat... but it clears mid-ff and bounces away to the rope, brings the requirement under 50 now"],"33.5":["Mohammad Irfan to Taylor","FOUR","short and pulled hard - four more! Wahab dived at deep backward square but could only help the ball on to the boundary"],"33.6":["Mohammad Irfan to Taylor","no run","length delivery, Taylor comes forward to block"],"34.1":["Zafar Gohar to Buttler","1 run","tossed up, Buttler get out and punches through a gap"],"34.2":["Zafar Gohar to Taylor","1 run","angled in and turned away through the leg side"],"34.3":["Zafar Gohar to Buttler","1 run","drops back, waits for the ball to turn away from him, stabs through point"],"34.4":["Zafar Gohar to Taylor","no run","tossed up and patted away into the off side"],"34.5":["Zafar Gohar to Taylor","FOUR","serves up a full toss and Taylor bunts it low past mid-on, it has the legs to outrun long-off for another boundary"],"34.6":["Zafar Gohar to Taylor","no run","looped up on off stump, leans into a forward defensive"],"35.1":["Shoaib Malik to Buttler","1 run","pushed through and steered square off the back foot"],"35.2":["Shoaib Malik to Taylor","SIX","full toss, Taylor gives it the big 'un and charges out to slap it through mid-off... in fact, he lands it right on the rope to bring up his fifty with a six!"],"35.3":["Shoaib Malik to Taylor","no run","round the wicket, tossed up on the stumps, dabbed into the leg side"],"35.4":["Shoaib Malik to Taylor","no run","pushed across the right-hander, runs it to backward point"],"35.5":["Shoaib Malik to Taylor","1 run","flighted, on leg stump, goes down low to sweep behind square"],"35.6":["Shoaib Malik to Buttler","1 run","on leg stump, tapped into a gap at square leg"],"36.1":["Zafar Gohar to Buttler","no run","slightly short, Buttler chops hard into the the covers but a diving stop prevents any runs"],"36.2":["Zafar Gohar to Buttler","no run","pushed back down the track"],"36.3":["Zafar Gohar to Buttler","1 run","drops back and gets his cut through the infield this time"],"36.4":["Zafar Gohar to Taylor","no run","drops back on off stump but doesn't quite connect properly"],"36.5":["Zafar Gohar to Taylor","1 run","drifting towards leg stump, gets down low to sweep, towards deep backward square... who then underarms a throw towards a team-mate who wasn't looking and Taylor briefly thinks about coming back for two"],"36.6":["Zafar Gohar to Buttler","2 runs","on off stump, reverse swept through backward point for a couple more"],"37.1":["Shoaib Malik to Taylor","FOUR","Taylor sweeps, top-edges towards deep square leg... who misses it completely! Gohar is signalling he couldn't see it in the lights as he ran in, the ball landed near his foot and bounced away for four"],"37.2":["Shoaib Malik to Taylor","1 run","outside leg and Taylor gets some glove on a sweep to loop it up and over leg slip this time"],"37.3":["Shoaib Malik to Buttler","1 run","tossed up on the stumps and swept fine for one more"],"37.4":["Shoaib Malik to Taylor","1 run","Taylor skips out and nurdles into the leg side"],"37.5":["Shoaib Malik to Buttler","2 runs","short and glanced off the hips from back in the crease - they scurry two more and that's the 100 stand between these two, looking like a match-winner"],"37.6":["Shoaib Malik to Buttler","1 run","on the stumps, flicked leg side for one more"],"38.1":["Iftikhar Ahmed to Buttler","1 run","round the wicket, nudged through square leg"],"38.2":["Iftikhar Ahmed to Taylor","no run","tossed up and blocked back on the leg side"],"38.3":["Iftikhar Ahmed to Taylor","1 run","flat offbreak down leg, flicked away to deep backward square"],"38.4":["Iftikhar Ahmed to Buttler","no run","turned to leg from the crease"],"38.5":["Iftikhar Ahmed to Buttler","no run","leg-stump line, hits the pads and rolls away"],"38.6":["Iftikhar Ahmed to Buttler","no run","flighted, Buttler waits on it and taps back down the track, no longer in any hurry"],"39.1":["Anwar Ali to Taylor","1 run","length on the stumps and flicked behind square"],"39.2":["Anwar Ali to Buttler","1 run","drops short, sits up nicely to be pulled through midwicket for one"],"39.3":["Anwar Ali to Taylor","1 run","shortish, over the top of off, Taylor closes the face and nudges square to the leg side"],"39.4":["Anwar Ali to Buttler","1 run","back of a length outside off, Buttler dabs it down to third man - 200 up for England, they're getting there without breaking sweat now"],"39.5":["Anwar Ali to Taylor","1 run","shortish, 78mph outside off, Taylor glides another single to third man"],"39.6":["Anwar Ali to Buttler","no run","gets across and pushes gently into the off side"],"40.1":["Iftikhar Ahmed to Taylor","no run","length outside leg stump, tapped away"],"40.2":["Iftikhar Ahmed to Taylor","2 runs","goes down on one knee very early, waits for the ball to come on and flicks a paddle shot over his shoulder for a couple"],"40.3":["Iftikhar Ahmed to Taylor","no run","over the wicket, pushed through and blocked"],"40.4":["Iftikhar Ahmed to Taylor","no run","flat on the stumps, defended again"],"40.5":["Iftikhar Ahmed to Taylor","1 run","shuffles forward, clips back to the bowler's right... a misfield gives Taylor one more"],"40.6":["Iftikhar Ahmed to Buttler","SIX","there it is, crashed over deep midwicket for the winning hit! Buttler saunters out and clubs the ball well beyond the rope to finish unbeaten on 49, as England win by six wickets to go 2-1 up in the series"]}